config/migemo_config.org
# -*- mode: org; coding: utf-8-unix; indent-tabs-mode: nil -*-
#
# Copyright(C) Youhei SASAKI All rights reserved.
# $Lastupdate: 2012/03/28 04:02:09$
# License: Expat.
#+TITLE: Migemo の設定
#+AUTHOR: Youhei SASAKI
#+EMAIL: uwabami@gfd-dennou.org
* byte-compile 用の小細工                                          :noexport:
#+BEGIN_SRC emacs-lisp
  (when (locate-library "migemo")
#+END_SRC
* はじめに
** ユーザ辞書を使わない
#+BEGIN_SRC emacs-lisp
  (setq migemo-user-dictionary nil)
  (setq migemo-regex-dictionary nil)
#+END_SRC
** キャッシュ機能を利用する
#+BEGIN_SRC emacs-lisp
  (setq migemo-use-pattern-alist t)
  (setq migemo-pattern-alist-file (concat user-emacs-directory "tmp/migemo-pattern"))
  (setq migemo-use-frequent-pattern-alist t)
  (setq migemo-frequent-pattern-alist-file (concat user-emacs-directory "tmp/migemo-frequent"))
  (setq migemo-pattern-alist-length 2048)
#+END_SRC
** 読み込み
#+BEGIN_SRC emacs-lisp
  (cond
   ((file-executable-p "/usr/bin/cmigemo")
    (setq migemo-command "/usr/bin/cmigemo")
    (setq migemo-options '("-q" "--emacs"))
    (setq migemo-dictionary "/usr/share/cmigemo/utf-8/migemo-dict")
    (setq migemo-coding-system 'utf-8-unix))
   (t
    (setq migemo-command "/usr/bin/migemo")
    (setq migemo-options '("-S" "migemo" "-t" "emacs"  "-i" "\a")))
    )
  (load-library "migemo")
  (migemo-init)
#+END_SRC
* byte-compile 用の小細工                                          :noexport:
#+BEGIN_SRC emacs-lisp
)
#+END_SRC

