config/migemo_config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Migemo の設定</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Migemo の設定"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-28T04:02+0900"/>
<meta name="author" content="Youhei SASAKI"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Migemo の設定</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 はじめに</a>
<ul>
<li><a href="#sec-1-1">1.1 ユーザ辞書を使わない</a></li>
<li><a href="#sec-1-2">1.2 キャッシュ機能を利用する</a></li>
<li><a href="#sec-1-3">1.3 読み込み</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> はじめに</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> ユーザ辞書を使わない</h3>
<div class="outline-text-3" id="text-1-1">




<pre class="src src-emacs-lisp">(setq migemo-user-dictionary nil)
(setq migemo-regex-dictionary nil)
</pre>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> キャッシュ機能を利用する</h3>
<div class="outline-text-3" id="text-1-2">




<pre class="src src-emacs-lisp">(setq migemo-use-pattern-alist t)
(setq migemo-pattern-alist-file (concat user-emacs-directory <span style="color: #ffff00;">"tmp/migemo-pattern"</span>))
(setq migemo-use-frequent-pattern-alist t)
(setq migemo-frequent-pattern-alist-file (concat user-emacs-directory <span style="color: #ffff00;">"tmp/migemo-frequent"</span>))
(setq migemo-pattern-alist-length 2048)
</pre>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 読み込み</h3>
<div class="outline-text-3" id="text-1-3">




<pre class="src src-emacs-lisp">(<span style="color: #00ffff;">cond</span>
 ((file-executable-p <span style="color: #ffff00;">"/usr/bin/cmigemo"</span>)
  (setq migemo-command <span style="color: #ffff00;">"/usr/bin/cmigemo"</span>)
  (setq migemo-options '(<span style="color: #ffff00;">"-q"</span> <span style="color: #ffff00;">"--emacs"</span>))
  (setq migemo-dictionary <span style="color: #ffff00;">"/usr/share/cmigemo/utf-8/migemo-dict"</span>)
  (setq migemo-coding-system 'utf-8-unix))
 (t
  (setq migemo-command <span style="color: #ffff00;">"/usr/bin/migemo"</span>)
  (setq migemo-options '(<span style="color: #ffff00;">"-S"</span> <span style="color: #ffff00;">"migemo"</span> <span style="color: #ffff00;">"-t"</span> <span style="color: #ffff00;">"emacs"</span>  <span style="color: #ffff00;">"-i"</span> <span style="color: #ffff00;">"\a"</span>)))
  )
(load-library <span style="color: #ffff00;">"migemo"</span>)
(migemo-init)
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-28T04:02+0900</p>
<p class="author">Author: Youhei SASAKI</p>
<p class="creator">Org version 7.8.06 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
